import "./About.css";

export default function About() {
  return (
    <div className="about">
      <p>
        Ο παλαιός ναός του Αγίου Κοσμά οικοδομήθηκε το 1908. Το σημερινό
        μοναστήρι χτίστηκε σε έκταση, δίπλα από τον παλαιό ναό, που παραχωρήθηκε
        από τρεις Μεγαλοδενδρίτες αδελφούς, το 1954 και με έρανο, αρχικά, μεταξύ
        των κατοίκων της περιφέρειας από το υστέρημα τους και αργότερα από
        πανελλήνιο έρανο.{" "}
      </p>
      <p>Η ανοικοδόμηση του ναού κράτησε έξι χρόνια. </p>
      <p>
        Η πρώτη πανηγυρική λειτουργία έγινε στις 24 Αυγούστου του 1961, οπόταν
        και αναγνωρίστηκε η επέτειος της μνήμης του Αγίου ως επίσημη τοπική
        γιορτή του Θέρμου.
      </p>
      <p>
        Συνεχίζεται μέχρι σήμερα η προσπάθεια για την ανακομιδή και μετακομιδή
        των ιερών λειψάνων του Αγίου Κοσμά στην γενέτειρα του, το Μέγα Δέντρο
        Θέρμου Αιτωλοακαρνανίας “Απόκουρον της Αιτωλίας”.
      </p>
      <p>
        Επίσης, συνεχίζεται και η προσπάθεια αποπεράτωσης των έργων σχετικά με
        την διαμόρφωση εσωτερικού και εξωτερικού χώρου του μοναστηριού όπως και
        των αγιογραφιών του καθολικού του.{" "}
      </p>
    </div>
  );
}
